doom/config.org
#+startup: show2levels
#+title: Doom Config

* Org-mode
** Normal-stuff
#+begin_src emacs-lisp
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
;; org-agenda-files '("~/Documents/agenda.org"
;;                    "~/Documents/School/RevisionTimetable.org")

(setq org-image-actual-width (/ (display-pixel-width) 10))

(set-register ?a (cons 'file (concat org-directory "general/lifeStuff/agenda.org")))


;; Org
(after! org
  :config
  (require 'org)
  (setq org-directory "~/Documents/"
        org-ellipsis " ↝ "
        org-pretty-entities t
        org-fold-core-style 'overlays
        org-superstar-special-todo-items t
        org-agenda-include-diary t
        org-log-done 'time
        org-log-into-drawer 'time))

#+end_src
** Org-roam
#+begin_src emacs-lisp
; org-roam setup
(after! org-roam
  :config
  (require 'org-roam)
  (setq org-roam-directory "~/Documents/general"
        org-roam-dailies-capture-templates
        '(("d" "default"
           entry "* %<%I:%M %p>: \n%?"
           :if-new (file+head "%<%Y-%m-%d>.org.gpg" "#+title: %<%Y-%m-%d>\n")))
        org-roam-dailies-directory "~/Documents/general/journal/")
        (add-to-list 'display-buffer-alist
             '("\\*org-roam\\*"
               (display-buffer-in-side-window)
               (side . right)
               (slot . 0)
               (window-width . 0.24)
               (window-parameters . ((no-other-window . t)
                                     (no-delete-other-windows . t))))))

(setq epa-file-encrypt-to "arlo.hicks@pm.me")

;; (add-to-list 'display-buffer-alist
;;              '("\\*org-roam\\*"
;;                (display-buffer-in-direction)
;;                (direction . right)
;;                (window-width . 0.33)
;;                (window-height . fit-window-to-buffer)))

#+end_src
*** Org-roam-buffer
#+begin_src emacs-lisp :tangle no
(setq org-roam-mode-sections
      (list #'org-roam-backlinks-section
            #'org-roam-reflinks-section
            ;; #'org-roam-unlinked-references-section
            ))

(add-to-list 'display-buffer-alist
             '("\\*org-roam\\*"
               (display-buffer-in-direction)
               (direction . left)
               (window-width . 0.33)
               (window-height . fit-window-to-buffer)))
#+end_src

#+begin_src emacs-lisp :tangle no
(setq org-roam-mode-sections
      (list #'org-roam-backlinks-section
            #'org-roam-reflinks-section
            ;; #'org-roam-unlinked-references-section
            ))

(add-to-list 'display-buffer-alist
             '("\\*org-roam\\*"
               (display-buffer-in-side-window)
               (side . right)
               (slot . 0)
               (window-width . 0.33)
               (window-parameters . ((no-other-window . t)
                                     (no-delete-other-windows . t)))))
#+end_src
** Bibtex Stuff
#+begin_src emacs-lisp
;; Org-roam-bibtex
(use-package! org-roam-bibtex
  :after org-roam
  :config
  (require 'org-ref))

;; Org-ref
(use-package! org-ref
  :init
  (require 'bibtex)
  (setq bibtex-autokey-year-length 4
	bibtex-autokey-name-year-separator "-"
	bibtex-autokey-year-title-separator "-"
	bibtex-autokey-titleword-separator "-"
	bibtex-autokey-titlewords 2
	bibtex-autokey-titlewords-stretch 1
	bibtex-autokey-titleword-length 5
        org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f")))

(setq bibtex-dialect 'biblatex)

;; ivy-bibtex
(use-package! ivy-bibtex
  :init
  (setq bibtex-completion-bibliography '("~/Documents/biblio/books.bib"
                                         "~/Documents/biblio/papers.bib")
        bibtex-completion-notes-path "~/Documents/biblio/notes/"
	bibtex-completion-library-path '("~/Documents/biblio/bibtex-pdfs/")
	bibtex-completion-notes-template-multiple-files "* ${author-or-editor}, ${title}, ${journal}, (${year}) :${=type=}: \n\nSee [[cite:&${=key=}]]\n"
	bibtex-completion-additional-search-fields '(keywords)
	bibtex-completion-display-formats
	'((article       . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${journal:40}")
	  (inbook        . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
	  (incollection  . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
	  (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
	  (t             . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}"))
	bibtex-completion-pdf-open-function
	(lambda (fpath)
	  (call-process "open" nil 0 nil fpath))))

(use-package! org-ref-ivy
  :init
  (setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body
        org-ref-insert-cite-function 'org-ref-cite-insert-ivy
        org-ref-insert-label-function 'org-ref-insert-label-link
        org-ref-insert-ref-function 'org-ref-insert-ref-link
        org-ref-cite-onclick-function (lambda (_) (org-ref-citation-hydra/body))))

#+end_src
** Org-journal (disabled)
#+begin_src emacs-lisp
;; (after! org-journal
;;   :config
;;   (require 'org-crypt)
;;   (setq org-journal-dir '"~/Documents/Journal/"
;;         org-journal-file-type 'weekly
;;         org-journal-date-format "%A, %d %B %Y"
;;         org-journal-encrypt-journal't))
#+end_src

** Org-roam-UI
#+begin_src emacs-lisp 
;;      Org roam ui
(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
#+end_src

** Org-Capture-Templates
#+begin_src emacs-lisp
;; Org-protocol
(server-start)
(require 'org-protocol)

(setq org-capture-templates
      `(
        ("b" "Book" entry (file+headline "~/Documents/general/lifeStuff/book.org" "2022")
         "* TODO %?\nSCHEDULED: %T\n:PROPERTIES:\n:style: habit\n:author: %^{Author}\n:year: %^{Year}\n:page: %^{Current Page}\n:length: %^{Total Pages}\n:logging: DONE(!) lognotedone\n:END:\n%U")

        ("t" "Todo" entry (file "~/Documents/general/lifeStuff/agenda.org")
         "* TODO %?\n:PROPERTIES:\n:CAPTURED: %U\n:END:%i" :empty-lines 1)

        ("T" "Todo + file link" entry (file "~/Documents/general/lifeStuff/agenda.org")
         "* TODO %?\n:PROPERTIES:\n:CAPTURED: %U\n:FILE: file:%F\n:END:%i" :empty-lines 1)

        ("f" "Flashcard" entry (file+headline "~/Documents/general/biology.org" "Flashcards")
         "*  %?\n:PROPERTIES:\n:ANKI_DECK: %U\n:FILE: file:%F\n:END:%i" :empty-lines 1)

        ;; ("s" "School" entry (file+headline "~/Documents/general/lifeStuff/agenda.org" "School Agenda")
        ;;  "* TODO %? :school:\n:PROPERTIES:\n:CAPTURED: %U\n:END:\n%i" :empty-lines 1)

        ("p" "Paper" entry (file+headline "~/Documents/general/papers.org" "Data:")
         "* %U\n:PROPERTIES:\n:date: %U\n:source: %^{source}\n:topic: %^{topic}\n:marks: %^{marks}\n:total: %^{total marks}\n:END:\n%?" :empty-lines 1)

        ("c" "Contact" entry (file "~/Documents/general/contacts.org.gpg")
         "* %(Contact name)\n:PROPERTIES:\n:address: %^{Address}\n:birthday: %^{yyyy-mm-dd}\n:email: %(Email)\n:anniversary: %^{yyyy-mm-dd}\n:occupation: %^{Job}\n:note: %^{NOTE}\n:END:" "Template for org-contacts." :empty-lines 1)

        ("p" "Protocol" entry (file+headline ,"~/Documents/general/lifeStuff/ReadWatchLater.org.gpg" "To-read:")
         "* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
        ("L" "Protocol Link" entry (file+headline ,"~/Documents/general/lifeStuff/ReadWatchLater.org.gpg" "To-read:")
         "* [[%:link][%:description]] \n:PROPERTIES:\n:CAPTURED: %U\n:END:\n%?")
        ))

;; Org-habit
;; (use-package! org-habit
;;   :after org
;;   :config
;;   (setq org-habit-following-days 7
;;         org-habit-preceding-days 35
;;         org-habit-show-habits t)  )

#+end_src
