doom/config.el

(use-package! org-super-agenda
  :after org-super-agenda
  :config
  (setq org-super-agenda-groups '(
                                  ;; (:name "Personal"
                                  ;;        :habit t
                                  ;;        :order 9)
                                  ;; (:name "Today"  ; Optionally specify section name
                                  ;;        :time-grid t
                                  ;;        :date today
                                  ;;        :order 0)  ; Items that appear on the time grid
                                  (:order-multi (0
                                                 (:name "Test"
                                                  :tag "test")))
                                  (:order-multi (1
                                                 (:name "Maths"
                                                  :tag "maths")
                                                 (:name "Biology"
                                                  :tag "biology")
                                                 (:name "Chemistry"
                                                  :tag "chemistry")))

                                  (:name "Clubs"
                                   :tag "club"
                                   :order 3)

                                  (:name "General"
                                   ;; :todo "TODO"
                                   :time-grid t
                                   :order 5)

                                  (:name "Books to read"
                                   :and (:todo ("WANT" "READING"))
                                   :order 8)
                                  ;; (:discard (:anything t))

                                  (:name "Miscellaneous"
                                   :and (:scheduled nil :deadline nil)
                                   :order 9)
                                  )))
  ;; (org-agenda nil "a"))
(org-super-agenda-mode)

(setq org-agenda-custom-commands
      '(("cc" "Clubs"
         ((org-ql-block '(and (tags "club")))
          (agenda)))
        ("cg" "Important Stuff"
         ((org-ql-block '(and (tags "test")))))))

(setq org-agenda-sorting-strategy
      '((agenda time-up habit-up priority-down category-keep)
        (todo   priority-down category-keep)
        (tags   priority-down category-keep)
        (search category-keep)))

(defun calculate-effort (marks-achieved total-marks)
  (interactive)
  (let ((/ (* marks-achieved 100.0) total-marks))
    (if (> effort 100)
        100
      (* effort 100))))

(defun add-exam ()
  (interactive)
  (let ((subject (read-string "Enter exam subject: "))
        (topic (read-string "Enter exam topic: "))
        (marks-achieved (string-to-number (read-string "Enter marks achieved: ")))
        (total-marks (string-to-number (read-string "Enter total marks: "))))
    (find-file "exam-data.org")
    (goto-char (point-min))
    (if (search-forward-regexp (concat "^* " subject "$") nil t)
        (progn
          (org-narrow-to-subtree)
          (if (search-forward-regexp (concat "^** " topic "$") nil t)
              (progn
                (org-set-property "effort" (number-to-string (calculate-effort marks-achieved total-marks)))
                (widen))
            (progn
              (org-insert-subheading nil)
              (insert topic)
              (org-set-property "effort" (number-to-string (calculate-effort marks-achieved total-marks)))
              (widen)))
          (message "Exam data added successfully."))
      (progn
        (goto-char (point-max))
        (org-insert-heading)
        (insert subject)
        (org-insert-subheading nil)
        (insert topic)
        (org-set-property "effort" (number-to-string (calculate-effort marks-achieved total-marks)))
        (message "Exam data added successfully.")))))

;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name ""
      user-mail-address "")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
;; ((setq doom-theme 'doom-tomorrow-night)
;; (setq doom-theme 'doom-snazzy)
;; (use-package-hook! doom-themes
;;   :pre-config
;;   (remove-hook 'doom-load-theme-hook #'doom-themes-org-config))

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.

;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open Documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.

(setq display-line-numbers-type 'relative)

(setq doom-theme 'doom-one
      doom-font (font-spec :family "RobotoMono Nerd Font Mono" :size 15)
     doom-variable-pitch-font (font-spec :family "RobotoMono Nerd Font Mono" :size 15))

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
;;(setq custom-theme-directory "~/.doom.d/themes/")
;;(load-theme 'doom-nord-theme.el)

;; language tool setup
(after! langtool
  :config
  (require 'langtool)
  (setq langtool-bin "/usr/bin/languagetool"
        langtool-default-language "en-GB"))

;; Treemacs
(after! treemacs
  :ensure t
  :config
