doom/config.org
* Treemacs
#+begin_src emacs-lisp
;; Treemacs
(after! treemacs
  :ensure t
  :config
  (setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
        treemacs-deferred-git-apply-delay        0.5
        treemacs-directory-name-transformer      #'identity
        treemacs-display-in-side-window          t
        treemacs-eldoc-display                   'simple
        treemacs-file-event-delay                5000
        treemacs-file-extension-regex            treemacs-last-period-regex-value
        treemacs-file-follow-delay               0.2
        treemacs-file-name-transformer           #'identity
        treemacs-follow-after-init               t
        treemacs-expand-after-init               t
        treemacs-find-workspace-method           'find-for-file-or-pick-first
        treemacs-git-command-pipe                ""
        treemacs-goto-tag-strategy               'refetch-index
        treemacs-header-scroll-indicators        '(nil . "^^^^^^")
        treemacs-hide-dot-git-directory          t
        treemacs-indentation                     2
        treemacs-indentation-string              " "
        treemacs-is-never-other-window           nil
        treemacs-max-git-entries                 5000
        treemacs-missing-project-action          'ask
        treemacs-move-forward-on-expand          nil
        treemacs-no-png-images                   nil
        treemacs-no-delete-other-windows         t
        treemacs-project-follow-cleanup          nil
        treemacs-persist-file                    "~/.emacs.d/modules/ui/treemacs/treemacs-persist"
        treemacs-position                        'left
        treemacs-read-string-input               'from-child-frame
        treemacs-recenter-distance               0.1
        treemacs-recenter-after-file-follow      nil
        treemacs-recenter-after-tag-follow       nil
        treemacs-recenter-after-project-jump     'always
        treemacs-recenter-after-project-expand   'on-distance
        treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
        treemacs-show-cursor                     nil
        treemacs-show-hidden-files               t
        treemacs-silent-filewatch                nil
        treemacs-silent-refresh                  nil
        treemacs-sorting                         'alphabetic-asc
        treemacs-select-when-already-in-treemacs 'move-back
        treemacs-space-between-root-nodes        t
        treemacs-tag-follow-cleanup              t
        treemacs-tag-follow-delay                1.5
        treemacs-text-scale                      nil
        treemacs-user-mode-line-format           nil
        treemacs-user-header-line-format         nil
        treemacs-wide-toggle-width               70
        treemacs-width                           35
        treemacs-width-increment                 1
        treemacs-width-is-initially-locked       t
        treemacs-workspace-switch-cleanup        nil))
;; treemacs-follow-mode t
;; treemacs-filewatch-mode t))

#+end_src
* Calendar
#+begin_src emacs-lisp
;; Calendar
;; Month
(use-package! calendar
  :init
  :config
  (require 'calendar)
  (setq calendar-month-name-array
        ["janvier" "février" "mars"     "avril"   "mai"      "juin"
         "juillet"    "aout"   "septembre" "octobre" "novembre" "décembre"]
        calendar-day-name-array
        ["dimanche" "lundi" "mardi" "mercredi" "jeudi" "vendredi" "samedi"]
        calendar-week-start-day 1))

(require 'calfw)
(require 'calfw-org)
(defun open-my-calendar ()
  (interactive)
  (cfw:open-calendar-buffer
   :contents-sources
   (list
    (cfw:org-create-source "Green"))))

(after! org-gcal
  :config
  (setq org-gcal-client-id "270350628842-3fmpu5kn8ee2q0110e42a2mgsblen6hp.apps.googleusercontent.com"
      org-gcal-client-secret "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"
      org-gcal-fetch-file-alist '(("goeagle.hero@gmail.com" .  "~/Documents/general/lifeStuff/agenda.org")
                                  ("3a583e5c5a02c73301ff0401e411268631175ea0bcd083b634b35ca672811c1d@group.calendar.google.com" . "~/Documents/general/timetable.org"))
      plstore-cache-passphrase-for-symmetric-encryption t))
#+end_src

* Visual-column??
#+begin_src emacs-lisp
;; Visual-column-fill
(after! visual-fill-column
  :config
  (setq-default visual-fill-column-center-text t))
#+end_src
* Tabs
#+begin_src emacs-lisp
;; Tabs
(after! centaur-tabs
  :config
  (setq centaur-tabs-style "wave"
        centaur-tabs-height 30
        centaur-tabs-set-icons t
        centaur-tabs-set-modified-marker t
        centaur-tabs-set-bar nil
        x-underline-at-descent-line t
        centaur-tabs-adjust-buffer-order t)

  (defun centaur-tabs-hide-tab (x)
    "Do no to show buffer X in tabs."
    (let ((name (format "%s" x)))
      (or
       ;; Current window is not dedicated window.
       (window-dedicated-p (selected-window))

       ;; Buffer name not match below blacklist.
       (string-prefix-p "*epc" name)
       (string-prefix-p "*helm" name)
       (string-prefix-p "*Helm" name)
       (string-prefix-p "*Compile-Log*" name)
       (string-prefix-p "*lsp" name)
       (string-prefix-p "*company" name)
       (string-prefix-p "*Flycheck" name)
       (string-prefix-p "*tramp" name)
       (string-prefix-p " *Mini" name)
       (string-prefix-p "*help" name)
       (string-prefix-p "*straight" name)
       (string-prefix-p " *temp" name)
       (string-prefix-p "*Help" name)
       (string-prefix-p "*mybuf" name)

       ;; Is not magit buffer.
       (and (string-prefix-p "magit" name)
	    (not (file-name-extension name)))
       ))))
#+end_src
* Deft
#+begin_src emacs-lisp
(after! deft
  :config
  (setq deft-extensions '("org")
        deft-directory "~/Documents/general"
        deft-recursive t
        deft-use-filename-as-title t))
#+end_src
* Keybinds
#+begin_src emacs-lisp
;; KEYBINDS
(map! :leader
      (:prefix-map ("e" . "extra")
       :desc "Open Calendar" "o" #'cfw:open-org-calendar
       :desc "Org-ql view" "v" #'org-ql-view
       :desc "Org-ql Search" "s" #'org-ql-search
       (:prefix ("t" . "transclusion")
        :desc "Add" "a" #'org-transclusion-add
        :desc "Remove" "r" #'org-transclusion-deactivate
        :desc "Open source" "o" #'org-transclusion-open-source
        :desc "Refresh source" "f" #'org-transclusion-refresh
        :desc "Start live sync" "s" #'org-transclusion-live-sync-start
        :desc "End live sync" "e" #'org-transclusion-live-sync-exit
        )))

;; Disable evil-mode in local buffer with F12
(global-set-key (kbd "<XF86RFKill>") 'evil-local-mode)

#+end_src
* Books (disabled)
#+begin_src emacs-lisp :tangle no
;; Books
;; (setq! org-books-file "~/Documents/Books/book.org")
#+end_src

* Todo Stuff

#+begin_src emacs-lisp
(setq! hl-todo-keyword-faces
       '(("WANT"        . "#b467f9")
         ("READ"        . "#2be3fc")
         ("READING"     . "#ff886a")))
#+end_src
* Dired
#+begin_src emacs-lisp
;; Dired
(use-package! dired
  :config
  (ranger-override-dired-mode t))
#+end_src
* Modeline
#+begin_src emacs-lisp
;; Doom-modeline
(after! doom-modeline
  :config
  (setq doom-modeline--battery-status t
        doom-modeline-major-mode-icon t
        doom-modeline-enable-word-count t))
#+end_src
* Elfeed
#+begin_src emacs-lisp :tangle no
(after! elfeed
  (setq rmh-elfeed-org-files '(concat org-directory "elfeed.org"))
        elfeed-feeds         '("https://this-week-in-rust.org/rss.xml"	"http://feeds.bbci.co.uk/news/rss.xml"))
#+end_src
