doom/config.org
* Vertico
#+begin_src emacs-lisp
;; Enable vertico
;; (use-package vertico
;;   :init
;;   (vertico-mode)

  ;; Different scroll margin
  ;; (setq vertico-scroll-margin 0)

  ;; Show more candidates
  ;; (setq vertico-count 20)

  ;; Grow and shrink the Vertico minibuffer
  ;; (setq vertico-resize t)

  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  ;; (setq vertico-cycle t)
  ;; )

;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist
  :init
  (savehist-mode))

;; A few more useful configurations...
(use-package emacs
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
  ;; Vertico commands are hidden in normal buffers.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable recursive minibuffers
  (setq enable-recursive-minibuffers t))
#+end_src

** Orderless
#+begin_src emacs-lisp
(after! orderless
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))
#+end_src
** Posframe
#+begin_src emacs-lisp :tangle no
(use-package! vertico-posframe
  :config
  (setq vertico-posframe-parameters
      '((left-fringe . 8)
        (right-fringe . 8)))
  (setq vertico-posframe-border-width 2))
(vertico-posframe-mode 1)
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package! vertico-posframe
  :config
  (setq vertico-posframe-parameters
      '((left-fringe . 8)
        (right-fringe . 8)))
  (setq vertico-posframe-border-width 3)

  :init
  (vertico-posframe-mode)

  (defface vertico-posframe-dim-face
    '((t (:foreground "gray40")))
    "Face for whole window background when posframe is active.")
  (setq vertico-posframe-aside-rules
        '("find-file" "consult-line" "consult-imenu" "consult-eglot-symbols" "project-find-regexp" "consult-yank" "xref"))
  (defun vertico-posframe--rules-match-p (rules)
    "Tests whether current command or buffer matches one of the RULES."
    (cl-some
     (lambda (rule)
       (cond ((functionp rule)
              (funcall rule))
             ((and rule
                   (stringp rule)
                   (symbolp this-command))
              (string-match-p rule (symbol-name this-command)))
             ((symbolp rule)
              (symbol-value rule))
             (t nil)))
     rules))
  (setq vertico-posframe--overlays-back nil)
  (defun vertico-posframe--add-overlays ()
    "Create a dim background overlay for each window on WND-LIST."
    (let* ((wnd (minibuffer-selected-window))
           (windows (window-list (window-frame wnd) 0))
           (windows-to-dim
            (if (vertico-posframe--rules-match-p vertico-posframe-aside-rules)
                (--select (not (eq it wnd)) windows)
              windows)))
      (setq vertico-posframe--overlays-back
            (append
             vertico-posframe--overlays-back
             (mapcar (lambda (w)
                       (let ((ol (make-overlay
                                  (window-start w)
                                  (window-end w)
                                  (window-buffer w))))
                         (overlay-put ol 'face 'aw-background-face)
                         ol))
                     windows-to-dim)))))

  (defun vertico-posframe--remove-overlays ()
    (mapc #'delete-overlay vertico-posframe--overlays-back)
    (setq vertico-posframe--overlays-back nil))

  (advice-add 'vertico-posframe--setup :after #'vertico-posframe--add-overlays)
  (advice-add 'vertico-posframe--minibuffer-exit-hook :after #'vertico-posframe--remove-overlays)

  (defun lazy/posframe-poshandler-besides-selected-window (info)
    (let* ((window-left (plist-get info :parent-window-left))
           (window-width (plist-get info :parent-window-width))
           (window-right (+ window-left window-width))
           (frame-width (plist-get info :parent-frame-width))
           (frame-height (plist-get info :parent-frame-height))
           (posframe-width (plist-get info :posframe-width))
           (posframe-height (plist-get info :posframe-height))
           (space-left window-left)
           (space-right (- frame-width window-right))
           (space-inside (- window-width posframe-width))
           (wanted-top (/ (- frame-height posframe-height) 2)))
      (cond
       ((>= space-right posframe-width)
        (cons window-right wanted-top))
       ((>= space-left posframe-width)
        (cons (- window-left posframe-width) wanted-top))
       ((>= space-inside posframe-width)
        (cons (- window-right posframe-width) wanted-top))
       (t
        (posframe-poshandler-frame-center info)))))
  (setq vertico-posframe-poshandler #'lazy/posframe-poshandler-besides-selected-window)
  (defun lazy/vertico-posframe-get-size ()
    "The default functon used by `vertico-posframe-size-function'."
    (let ((width (- (round (* (frame-width) 0.5)) 2))
          (height (or vertico-posframe-min-height
                      (let ((height1 (+ vertico-count 1)))
                        (min height1 (or vertico-posframe-height height1))))))
      (list
       :height height
       :width width
       :min-height height
       :min-width width
       :max-height height
       :max-width width)))
  (setq vertico-posframe-size-function #'lazy/vertico-posframe-get-size))
#+end_src
** Citar
#+begin_src emacs-lisp
(use-package! citar
  :bind (("C-c b" . citar-insert-citation)
         :map minibuffer-local-map
         ("M-b" . citar-insert-preset))
  :custom
  (citar-bibliography '("~/Documents/biblio/papers.bib")))
(setq citar-symbols
      `((file ,(all-the-icons-faicon "file-o" :face 'all-the-icons-green :v-adjust -0.1) . " ")
        (note ,(all-the-icons-material "speaker_notes" :face 'all-the-icons-blue :v-adjust -0.3) . " ")
        (link ,(all-the-icons-octicon "link" :face 'all-the-icons-orange :v-adjust 0.01) . " ")))
(setq citar-symbol-separator "  ")
#+end_src
* Consult
#+begin_src emacs-lisp :tangle no
(consult-customize
 consult-ripgrep consult-git-grep consult-grep
 consult-bookmark consult-recent-file consult-xref
 consult--source-bookmark consult--source-file-register
 consult--source-recent-file consult--source-project-recent-file
 ;; my/command-wrapping-consult    ;; disable auto previews inside my command
 :preview-key '(:debounce 0.7 any)) ;; Option 1: Delay preview
 ;; :preview-key (kbd "M-."))      ;; Option 2: Manual preview
#+end_src
* ChatGPL
#+begin_src emacs-lisp
(use-package! chatgpt
  :defer t
  :config
  (unless (boundp 'python-interpreter)
    (defvaralias 'python-interpreter 'python-shell-interpreter))
  (setq chatgpt-repo-path (expand-file-name "straight/repos/ChatGPT.el/" doom-local-dir))
  (set-popup-rule! (regexp-quote "*ChatGPT*")
    :side 'bottom :size .5 :ttl nil :quit t :modeline nil)
  :bind ("C-c q" . chatgpt-query))
#+end_src
